# trueになる例
print("trueになる場合")
print("---------------------------------------------")
print("==の場合")
print("1==1", 1 == 1)
print('"a"=="a"', "a" == "a")

print("\n!=の場合")
print("1!=2", 1 != 2)

print("\n<の場合")
print("1<2", 1 < 2)

print("\n>の場合")
print("2>1", 2 > 1)

print("\n<=の場合")
print("1<=2", 1 <= 2)
print("24<=24", 24 <= 24)

print("\n>=の場合")
print("2>=1", 2 >= 1)
print("---------------------------------------------")

print("\n\nfalseになる場合")
print("---------------------------------------------")
print("==の場合")
print("1==2", 1 == 2)
print('"a"=="b"', "a" == "b")

print("\n!=の場合")
print("1!=1", 1 != 1)

print("\n<の場合")
print("2<1", 2 < 1)

print("\n>の場合")
print("1>2", 1 > 2)

print("\n<=の場合")
print("2<=1", 2 <= 1)
print("23<=24", 23 <= 24)

print("\n>=の場合")
print("1>=2", 1 >= 2)
print("---------------------------------------------")
